DELETE from [定额测算].[dbo].[材料单价库] WHERE 电算代号=9108210;
INSERT INTO [定额测算].[dbo].[台班定额] (
[文号]
      ,[电算代号]
      ,[机械名称与规格型号]
      ,[单位]
      ,[基期单价]
      ,[编制期价]
      ,[单重]
      ,[换算系数]
      ,[汇总标志]
      ,[主材标志]
      ,[材料运输类别]
      ,[LOCK]
      ,[甲供方式]
) VALUES ('材料基价2017',9108210,'液压摆式剪板机 8 * 4000','台班',52.67,52.67,0,NULL ,NULL ,0,'QT',0,NULL );
DELETE FROM [定额测算].[dbo].[材料单价库] WHERE 电算代号=9108228;
INSERT INTO [定额测算].[dbo].[台班定额] (
[文号]
      ,[电算代号]
      ,[机械名称与规格型号]
      ,[单位]
      ,[基期单价]
      ,[编制期价]
      ,[单重]
      ,[换算系数]
      ,[汇总标志]
      ,[主材标志]
      ,[材料运输类别]
      ,[LOCK]
      ,[甲供方式]
) VALUES ('材料基价2017',9108228,'数控液压板料折弯机 125T/4000','台班',53.28,53.28,0,NULL ,NULL ,0,'QT',0,NULL );
DELETE FROM [定额测算].[dbo].[材料单价库] WHERE 电算代号=9102681;
INSERT INTO [定额测算].[dbo].[台班定额] (
[文号]
      ,[电算代号]
      ,[机械名称与规格型号]
      ,[单位]
      ,[基期单价]
      ,[编制期价]
      ,[单重]
      ,[换算系数]
      ,[汇总标志]
      ,[主材标志]
      ,[材料运输类别]
      ,[LOCK]
      ,[甲供方式]
) VALUES ('材料基价2017',9102681,'连续顶锥转体牵引设备','台班',472.81,472.81,0,NULL ,NULL ,0,'QT',0,NULL );
